//테스트시의 오류 방지를 위해 기존 카테고리에 덧붙히는 형태로 작성했음(임시)
//백엔드 카테고리 변경 및 게시물 초기화 후 제대로 변경 예정
export const categories = [
  "공부",
  "운동",
  "커리어",
  "독서",
  "문화/취미",
  "투자/머니로그",
  "챌린지/다짐",
  "패션",
  "식단",
  "가족/친구",
  "생각/일기",
  "헬스",
  "맨몸운동",
  "크로스핏",
  "러닝",
  "걷기",
  "사이클",
  "등산",
  "축구",
  "농구",
  "풋살",
  "야구",
  "볼링",
  "골프",
  "배구",
  "럭비",
  "탁구",
  "배드민턴",
  "테니스",
  "하키",
  "복싱/킥복싱",
  "MMA",
  "유도",
  "태권도",
  "주짓수",
  "레슬링",
  "검도/펜싱",
  "수영",
  "서핑",
  "조정",
  "요가",
  "필라테스",
  "교정/재활",
  "스트레칭",
  "클라이밍",
  "롤러/인라인",
  "보드",
  "빙상",
  "스키/보드",
] as const;

//소분류로 나눠진 버전
export const groupedCategorys: { groupName: string; categories: Category[] }[] =
  [
    {
      groupName: "근력 / 트레이닝",
      categories: ["헬스", "맨몸운동", "크로스핏"],
    },
    {
      groupName: "유산소",
      categories: ["러닝", "걷기", "사이클", "등산"],
    },
    {
      groupName: "구기종목",
      categories: [
        "축구",
        "농구",
        "풋살",
        "야구",
        "볼링",
        "골프",
        "배구",
        "럭비",
      ],
    },
    {
      groupName: "라켓 / 스틱",
      categories: ["탁구", "배드민턴", "테니스", "하키"],
    },
    {
      groupName: "격투 / 무술",
      categories: [
        "복싱/킥복싱",
        "MMA",
        "유도",
        "태권도",
        "주짓수",
        "레슬링",
        "검도/펜싱",
      ],
    },
    {
      groupName: "수상",
      categories: ["수영", "서핑", "조정"],
    },
    {
      groupName: "자세",
      categories: ["요가", "필라테스", "교정/재활", "스트레칭"],
    },
    {
      groupName: "등반",
      categories: ["클라이밍"],
    },
    {
      groupName: "스케이트 / 스키",
      categories: ["롤러/인라인", "보드", "빙상", "스키/보드"],
    },
  ];

export type Category = (typeof categories)[number];
