export default function Info() {
  const title = ["서비스 이용약관", "개인정보 정책", "커뮤니티 가이드라인"];
  const contents = [
    `제1조 (목적)
이 약관은 나는오늘운동한다(이하 "회사")가 제공하는 성취 기반 SNS 플랫폼(이하 "서비스")의 이용에 관한 조건과 절차, 회사와 사용자 간의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.
제2조 (용어의 정의)
  1. "서비스"란 회사가 제공하는 나는오늘운동한다 플랫폼을 통해 사용자가 성취를 기록하고 공유하며, 응원과 피드백을 받을 수 있는 인터넷 기반 SNS 플랫폼을 말합니다.
  2. "이용자"란 이 약관에 동의하고, 회사의 서비스를 이용하는 회원 및 비회원을 의미합니다.
  3. "회원"이란 회사에 가입하여 이용계약을 체결한 사람을 말합니다.
  4. "비회원"이란 회사에 가입하지 않고 서비스를 이용하는 사람을 말합니다.
제3조 (약관의 효력 및 변경)
  1. 이 약관은 서비스의 첫 페이지에서 이용자가 동의 버튼을 클릭함으로써 효력을 발생합니다.
  2. 회사는 필요에 따라 본 약관을 변경할 수 있으며, 변경된 약관은 서비스 내에 공지되며, 공지 후 7일 이내에 이용자는 변경된 약관을 확인하고 동의 여부를 판단해야 합니다.
  3. 이용자가 변경된 약관에 동의하지 않을 경우, 서비스 이용을 중단하거나 회원 탈퇴를 할 수 있습니다.
제4조 (이용 계약의 체결)
  1. 이용자는 회사의 서비스에 가입하여 회원가입을 신청함으로써 이용 계약이 체결됩니다.
  2. 회원가입을 신청한 이용자가 이 약관에 동의하면 회원 가입이 승인됩니다.
  3. 회사는 다음 각 호의 사유가 있을 경우 회원 가입을 거부할 수 있습니다.
    • 이용자가 이미 다른 계정으로 가입된 경우
    • 이용자가 실명이 아니거나, 허위 정보를 제공한 경우
    • 기타 회사가 정한 이용 기준에 부합하지 않는 경우
제5조 (회원의 의무)
  1. 회원은 서비스 이용 시 제공한 정보가 사실이고 정확한지 항상 확인해야 하며, 정보에 변경이 있을 경우 즉시 정보 수정을 해야 합니다.
  2. 회원은 자신의 아이디와 비밀번호에 대해 책임을 지며, 이를 타인에게 양도하거나 공유할 수 없습니다.
  3. 회원은 서비스 이용 시 다른 사용자의 권리나 법적 규제를 침해하지 않도록 해야 합니다.
제6조 (서비스 이용)
  1. 회사는 서비스의 제공을 위해 최선을 다하나, 서비스 이용의 중단이나 지연에 대해 책임지지 않습니다.
  2. 회사는 서비스 제공과 관련된 업데이트 및 유지보수 작업을 할 수 있으며, 이로 인해 서비스 이용이 제한될 수 있습니다.
  3. 이용자는 서비스 이용 중 발생한 문제를 회사에 신고할 수 있습니다.
제7조 (회원의 콘텐츠)
  1. 회원이 서비스에 업로드한 콘텐츠는 회원이 저작권을 보유합니다. 단, 회사는 서비스 운영을 위해 회원의 콘텐츠를 사용할 수 있는 비독점적 라이선스를 가집니다.
  2. 회원은 저작권법에 따라 자신이 업로드한 콘텐츠가 타인의 권리를 침해하지 않도록 주의해야 하며, 침해 시 모든 법적 책임을 지게 됩니다.
  3. 회사는 사용자의 콘텐츠가 불법적이거나 부적절한 내용일 경우 이를 삭제할 권리가 있습니다.
제8조 (서비스의 이용 제한 및 해지)
  1. 회사는 회원의 서비스 이용이 법적 규정에 위배되거나 타인의 권리를 침해하는 경우, 해당 회원의 계정을 일시 정지하거나 서비스 이용을 제한할 수 있습니다.
  2. 이용자는 언제든지 자신의 계정을 해지할 수 있으며, 해지 후에는 다시 서비스를 이용할 수 없습니다.
  3. 서비스 해지 시 회원의 모든 데이터가 삭제될 수 있으며, 이에 대해 회사는 책임지지 않습니다.
제9조 (서비스의 일시 중지 및 종료)
  1. 회사는 기술적인 문제, 법적 요구사항, 운영상의 이유로 서비스를 일시 중지하거나 종료할 수 있습니다.
  2. 서비스 종료 시 회사는 이용자에게 사전 고지하고, 이용자에게 발생할 수 있는 손해를 최소화하려고 노력합니다.
제10조 (책임의 한계)
  1. 회사는 서비스의 제공과 관련된 기술적 문제로 인한 손해에 대해 책임지지 않으며, 이용자의 행위에 따른 피해에 대해서도 책임지지 않습니다.
  2. 회사는 창작자가 작성한 콘텐츠의 품질·완전성·안정성·적법성 및 타인의 권리에 대한 비침해성, 적법성 등 일체에 대하여 보증하지 않습니다.
  3. 회사는 회원의 고의 또는 과실로 인하여 제3자에게 발생한 손해에 대하여는 아무런 책임을 부담하지 않으며, 회원이 자신의 비용과 책임으로 이를 해결하여야 합니다.
제11조 (개인정보 보호)
  1. 회사는 회원의 개인정보 보호를 중요시하며, 개인정보 보호법을 준수합니다.
  2. 개인정보 처리 방침에 대해 사용자는 동의하며, 회사는 회원의 개인정보를 목적 외 용도로 사용하지 않습니다.
제12조 (분쟁 해결)
  1. 이 약관과 관련한 분쟁은 회사의 본사 소재지 법원에서 해결됩니다.
  2. 분쟁 해결을 위한 협의는 선의의 노력으로 진행하며, 협의가 이루어지지 않으면 법적인 절차를 따릅니다.
제13조 (기타 사항)
  1. 회사는 이용약관의 일부를 수정할 수 있으며, 수정된 약관은 서비스 내 공지 후 7일 이내에 효력을 가집니다.
  2. 이용자가 약관의 변경에 동의하지 않을 경우, 서비스 이용을 중지하거나 회원 탈퇴를 선택할 수 있습니다.
부칙
  1. 이 약관은 2025년 8월 1일부터 시행됩니다.`,
    `나는오늘운동한다(이하 "회사" 또는 "나는오늘운동한다")는 서비스 이용자의 개인정보를 중요시하며, 개인정보 보호법을 준수하기 위해 최선을 다하고 있습니다. 본 개인정보 처리방침(이하 "방침")은 Achiva가 제공하는 서비스(이하 "서비스")를 이용하는 이용자의 개인정보를 어떻게 수집하고, 이용하며, 보호하는지에 대해 설명합니다. 이 방침은 2025년 8월 1일부터 시행됩니다.
1. 개인정보 수집 항목
회사는 서비스 제공을 위해 다음과 같은 개인정보를 수집할 수 있습니다:
  • 필수 항목:
    • 이메일 주소: 서비스 이용 및 알림 발송, 로그인, 비밀번호 찾기 등을 위해 수집
    • 비밀번호: 사용자 계정 보호를 위해 암호화하여 저장
    • IP 주소: 서비스 제공을 위한 네트워크 환경 점검 및 보안을 위해 수집
    • 생년월일: 사용자 가입연령 확인 및 연령대에 맞는 맞춤형 서비스 제공을 위해 수집
  • 선택 항목:
    • 프로필 사진: 사용자 개인화 및 서비스 편의성 향상을 위한 선택적 수집
2. 개인정보 수집 방법
회사는 다음의 방법으로 개인정보를 수집합니다:
  • 회원가입 시: 회원 가입 시 필수적으로 제공되는 정보
  • 서비스 이용 과정 중: 서비스 이용 중 발생할 수 있는 자동 수집 정보(IP 주소, 쿠키, 접속 로그 등)
  • 이벤트 또는 프로모션: 사용자가 자발적으로 참여하는 이벤트에서 수집되는 정보
3. 개인정보 이용 목적
회사는 수집한 개인정보를 다음과 같은 목적으로 이용합니다:
  • 회원 관리: 회원 가입, 본인 확인, 불법 사용자 방지, 고객 서비스 제공
  • 서비스 제공: 서비스의 원활한 제공, 이용자 맞춤형 서비스 제공
  • 마케팅 및 광고: 이벤트, 프로모션, 맞춤형 광고 제공 및 서비스 개선을 위한 분석
  • 법적 의무 준수: 법적 요구 사항을 준수하고 분쟁 해결을 위한 자료 보관
  • 보안: 서비스의 보안 유지 및 해킹, 부정 이용 방지를 위한 모니터링
4. 개인정보 보유 및 이용 기간
회사는 개인정보를 수집한 목적을 달성할 때까지 보유하고, 목적 달성 후에는 즉시 파기합니다. 다만, 관련 법령에 따라 보존이 필요한 정보는 법령에서 정한 기간 동안 보유할 수 있습니다.
  • 회원 가입 정보: 회원 탈퇴 후 1년 동안 보유(단, 서비스 이용 기록 등은 별도로 보존될 수 있음)
  • 법정 보유 기간: 세금 계산서 발행 등 법적 의무를 이행하기 위해 일정 기간 보관될 수 있습니다.
5. 개인정보의 제3자 제공
회사는 이용자의 개인정보를 제3자에게 제공하지 않습니다. 다만, 아래의 경우에는 예외적으로 제공될 수 있습니다:
  • 이용자의 동의가 있는 경우
  • 법률에 의한 요구가 있는 경우 (예: 법원의 명령, 정부 기관의 요청 등)
6. 개인정보 처리 위탁
회사는 원활한 서비스 제공을 위해 필요한 업무를 제3자에게 위탁할 수 있습니다. 이 경우, 위탁 받은 자는 개인정보 보호법에 따라 적절한 보호 조치를 취해야 합니다. 위탁하는 업무와 수탁자는 다음과 같습니다:
  • 서비스 제공업체: 시스템 운영 및 관리
  • 마케팅 업체: 광고 및 프로모션
위탁 시, 회사는 개인정보 보호 계약을 체결하고, 수탁자가 개인정보 보호 법규를 준수하도록 관리합니다.
7. 이용자의 권리와 행사 방법
  • 이용자는 언제든지 자신의 개인정보를 열람, 수정, 삭제하거나 동의 철회를 할 수 있습니다.
  • 동의 철회는 회원 탈퇴를 통해 이용약관, 개인정보 처리방침, 개인정보 처리 위탁 동의 등을 철회할 수 있습니다. 동의 철회 시, 해당 이용자는 서비스 이용에 제한이 있을 수 있습니다. 또한, 탈퇴 후 개인정보 처리 위탁에 대한 동의는 자동으로 철회되며, 사용자의 개인정보는 삭제되거나 반환됩니다.
  • 동의 철회를 원할 경우, 고객센터를 통해 처리 요청을 할 수 있으며, 이후 서비스 제공이 불가능할 수 있습니다.
8. 개인정보 처리 위탁
회사는 서비스 제공을 원활하게 하기 위해 다음과 같은 제3자에게 개인정보 처리 업무를 위탁할 수 있습니다. 이를 위해 회사는 위탁받은 업체가 개인정보 보호법을 준수하도록 관리하며, 적절한 보호조치를 취하고 있습니다.
  • 위탁받은 제3자가 개인정보를 처리할 때, 개인정보 보호법을 준수하도록 요구하며, 위탁 계약을 체결합니다. 제3자는 처리된 개인정보의 안전성 확보 및 기타 법적 요구사항을 준수할 의무를 가집니다.
  • 위탁된 개인정보 처리 종료 후, 개인정보는 삭제되거나 반환됩니다.
9. 쿠키의 사용
회사는 쿠키를 사용하여 사용자의 이용 환경을 개선합니다. 쿠키는 웹사이트가 사용자의 컴퓨터나 모바일 기기에 저장하는 작은 파일로, 이용자의 웹사이트 방문 기록을 추적하거나 사용자 맞춤형 서비스를 제공하는 데 사용됩니다. 사용자는 브라우저 설정에서 쿠키 사용을 거부할 수 있으며, 이 경우 일부 서비스 기능이 제한될 수 있습니다.
10. 개인정보의 안전성 확보 조치
회사는 이용자의 개인정보를 안전하게 보호하기 위해 다음과 같은 기술적, 관리적 조치를 취하고 있습니다:
  • 암호화: 개인정보는 암호화하여 저장 및 전송합니다.
  • 접근 통제: 개인정보 처리 시스템에 대한 접근을 권한이 있는 자로 제한하고 있습니다.
  • 보안 프로그램: 해킹이나 악성코드로부터 개인정보를 보호하기 위해 방화벽 및 백신 프로그램을 사용하고 있습니다.
11. 개인정보 처리방침 변경
회사는 개인정보 처리방침을 변경할 수 있습니다. 이 경우, 변경된 방침은 서비스 내 공지 또는 이메일을 통해고지하며, 변경된 방침은 공지된 날짜부터 효력이 발생합니다. 이용자는 변경된 방침에 동의하지 않을 경우, 서비스 이용을 중단하거나 탈퇴할 수 있습니다.
12. 개인정보 보호책임자
회사는 개인정보 보호를 위한 책임자를 두고 있습니다. 개인정보 보호 관련 문의는 아래로 연락해 주세요.
  • 이름: 김주안
  • 전화번호: 010-4183-1941
  • 이메일: contact@achiva.kr
부칙
  • 본 개인정보 처리방침은 2025년 8월 1일부터 시행됩니다.`,
    `나는오늘운동한다는 성취와 응원을 기반으로 하는 공간입니다. 모든 사용자는 서로를 존중하고 긍정적인 피드백을 주고받으며, 지속적인 성장과 발전을 이룰 수 있도록 도와야 합니다. 아래는 Achiva 커뮤니티 내에서 허용되는 행동과 금지된 행동에 대한 가이드라인입니다.
이 가이드라인에 동의한 후, 커뮤니티에 참여할 수 있으며, 이를 위반하는 경우 경고나 제재가 있을 수 있습니다.
1. 존중과 배려
  • 존중하는 대화: 모든 사용자는 서로를 존중하는 태도로 대화하고, 비방, 욕설, 혐오 발언 등을 삼가야 합니다.
  • 개인적인 공격 금지: 타인의 외모, 성격, 인종, 성별, 종교 등을 이유로 한 모욕적이거나 차별적인 발언은 금지됩니다.
  • 건설적인 피드백: 성취 기록에 대한 피드백은 건설적이고 격려의 메시지를 포함해야 하며, 부정적인 언어나 경멸적인 표현은 피해야 합니다.
2. 콘텐츠의 적절성
  • 합법적인 콘텐츠만 공유: 모든 콘텐츠는 법적으로 문제가 없는 콘텐츠여야 합니다. 저작권이 있는 자료를 허락 없이 공유하거나, 불법 콘텐츠를 업로드하는 행위는 금지됩니다.
  • 성적 콘텐츠, 폭력적 콘텐츠 금지: 성적 표현이나 폭력적인 내용, 혐오적이거나 불쾌감을 주는 이미지를 포함한 콘텐츠는 허용되지 않습니다.
  • 허위 정보 금지: 다른 사용자를 기만하거나 허위 사실을 퍼뜨리는 행위는 금지됩니다. 사실에 기반한 정보를 공유해주세요.
3. 개인정보 보호
  • 타인의 개인정보 보호: 타인의 개인정보를 무단으로 공유하거나 노출하는 것은 금지됩니다. 다른 사용자의 개인 정보를 존중하고, 자기 정보도 안전하게 관리하세요.
  • 스팸 및 광고 금지: 상업적 목적이나 스팸성 메시지를 포함한 콘텐츠는 허용되지 않습니다. 이는 부적절한 홍보와 광고를 포함합니다.
4. 커뮤니티 활동
  • 건전한 경쟁: 커뮤니티는 서로에게 동기부여가 되는 긍정적인 경쟁을 장려하되, 부정적인 경쟁이나 타인을 깎아내리는 행동은 금지됩니다.
  • 성취 공유: 자신의 성취를 자랑하거나 기만의 목적이 아닌, 긍정적인 피드백과 응원을 목적으로 공유해야 합니다.
  • 이벤트 및 도전: 커뮤니티 내에서 주최하는 이벤트나 도전에 참여할 때는 공정하게 참여하고, 타인의 성과를 존중하는 태도를 유지해야 합니다.
5. 금지된 행동
다음과 같은 행동은 절대적으로 금지됩니다:
  • 혐오 및 차별 발언: 인종, 성별, 종교, 성적 지향, 장애 등을 이유로 한 차별적, 모욕적 언어 사용
  • 욕설 및 부적절한 언어: 욕설, 비하 표현, 모욕적 코멘트 등 사회 통념상 부적절한 언어 사용
  • 불법 행위: 불법 활동 또는 범죄를 촉진·부추기는 콘텐츠 제작·공유
  • 부적절한 콘텐츠 공유: 성적, 폭력적, 혐오적, 아동 관련 부적절 콘텐츠
  • 사기 및 사칭: 다른 사용자 또는 기관을 사칭하거나, 사기 목적의 행동
  • 계정 거래/양도/대리/교환: 계정의 판매, 양도, 대여 또는 타인에게 이용을 허락하는 행위
  • 상업적·광고·홍보 목적 활동: 승인되지 않은 상업적 이용, 광고, 홍보, 타 이용자 서비스 방해 행위
  • 자살·동반자살 방조 및 유인: 자살이나 동반자살을 조장,유도,방조하거나 관련 콘텐츠를 공유하는 행위
  • 악의적 서비스 이용: 회사 승인 없이 서비스를 악용하거나, 서비스 운영을 방해하는 행위
  • 개인정보 침해: 타인의 개인정보를 동의 없이 수집, 공유, 공개하거나 악용하는 행위
  • 저작권·지적재산권 침해: 타인의 저작권, 상표권, 특허권 등 지적재산권을 침해하는 행위
  • 불법 프로그램 및 봇 사용: 무단 자동화, 해킹, 크롤링 등 서비스 정상 이용을 방해하는 프로그램 사용
6. 커뮤니티 관리 및 제재
  • 커뮤니티 규칙 위반 시: 사용자가 커뮤니티 가이드라인을 위반할 경우, 운영자는 상황에 따라 적절한 조치를 취할 수 있습니다.
    • 경고 및 콘텐츠 삭제: 비교적 경미한 위반 행위
    • 일시적 이용 제한: 반복적이거나 중간 수준의 위반 행위
    • 계정 정지 또는 영구 삭제: 심각하거나 고의적인 위반 행위
  • 사용자 신고: 부적절한 콘텐츠 또는 규칙 위반 행위를 발견하면, 신고 기능을 통해 운영자에게 알릴 수 있으며, 운영자는 신고 내용을 검토 후 적절한 조치를 취합니다.
  • 이의 제기: 제재를 받은 사용자는 재심의 요청을 제출할 권리가 있으며, 운영자는 요청 내용을 검토한 후 적절한 조치를 결정합니다.
7. 동의 및 변경 사항
  • 동의: 이 커뮤니티 가이드라인은 서비스 이용자가 가입 시 동의해야 하며, 가이드라인에 위반되는 행동을 할 경우 서비스 이용 제한을 받을 수 있습니다.
  • 변경 사항: 이 가이드라인은 정기적으로 업데이트될 수 있으며, 업데이트 시 회원에게 고지하고, 변경된 가이드라인에 동의해야 합니다.
  • 변경 고지 및 동의 : 커뮤니티 가이드라인 변경 시, 사용자는 변경된 가이드라인에 대해 사전 고지를 받고, 동의를 다시 해야서비스를 계속 이용할 수 있습니다. 변경된 가이드라인은 7일 전에 고지되며, 동의 여부를 묻는 확인 절차가 진행됩니다.
나는오늘운동한다 커뮤니티는 서로 서로를 존중하고 성취를 격려하는 공간입니다. 모든 사용자가 긍정적인 피드백과 건전한 경쟁을 통해 성장하고, 상호 작용할 수 있도록 협력해야 합니다. 본 가이드라인에 동의하고 준수하는 것은 Achiva 커뮤니티의 일원으로서의 책임이자 의무입니다.`,
  ];
  return (
    <div className="w-full flex-1 flex flex-col gap-7 min-h-0">
      {title.map((t, idx) => (
        <div key={t} className="flex-1 flex flex-col gap-2 min-h-0">
          <h2 className="text-lg font-bold">{t}</h2>
          <div className="flex-1 min-h-0 rounded-md border border-theme text-theme/50 text-sm overflow-hidden">
            <div className="h-full w-full overflow-y-auto whitespace-pre-wrap break-keep py-3 px-3.5">
              {contents[idx]}
            </div>
          </div>
        </div>
      ))}
    </div>
  );
}
